str1 = "Шляпка гриба, покрытая ... кожиц..й, держится на ... ножк.. . Снизу шляпка затянута ... плёнкой. Когда её уберёшь, откроется нижняяя ... сторона шляпк.. ."
print(str1)

a = input(' Введите первый пропуск : ')
b = input(' Введите первый пропуск : ')
c = input(' Введите третий пропуск : ')
d = input(' Введите четвертый пропуск : ')
t = input(' Введите пятый пропуск : ')
r = input(' Введите шестой пропуск : ')
i = input(' Введите седьмой пропуск : ')

str2 = f"Шляпка гриба, покрытая {a} кожиц{b}й, держится на {c} ножк{d} . Снизу шляпка затянута {t} плёнкой. Когда её уберёшь, откроется нижняяя {r} сторона шляпк{i} ."

print(str2)